#+title: ob-latex-as-png
#+author: Musa Al-hassy
#+options: d:nil toc:nil
#+macro: blurb An Org-babel “language” whose execution produces PNGs from LaTeX snippets; useful for shipping *arbitrary* LaTeX results in HTML

# Link: [[https://tex.stackexchange.com/questions/11866/compile-a-latex-document-into-a-png-image-thats-as-short-as-possible][Compile a LaTeX document into a PNG image that's as short as possible]]

* COMMENT MELPA Checks
  :PROPERTIES:
  :CUSTOM_ID: COMMENT-MELPA-Checks
  :END:
https://github.com/riscy/melpazoid

C-c C-c this block first!
#+begin_src emacs-lisp
(setq proj '~/ob-latex-as-png)
(setq file (second (s-split "/" (symbol-name proj))))
(setq proj.el (format "~/%s/%s.el" file file))
#+end_src

#+RESULTS:
: ~/ob-latex-as-png/ob-latex-as-png.el

1. [X] In Github repo: Create new file ⇒ License.txt ⇒ Select template ⇒ GNU 3
2. [X] Ensure first line ends with: -*- lexical-binding: t; -*-
3. [X] Include appropriate standard keywords;
   #+begin_src emacs-lisp
(pp finder-known-keywords)
   #+end_src

   #+RESULTS:
   #+begin_example
   ((abbrev . "abbreviation handling, typing shortcuts, and macros")
    (bib . "bibliography processors")
    (c . "C and related programming languages")
    (calendar . "calendar and time management tools")
    (comm . "communications, networking, and remote file access")
    (convenience . "convenience features for faster editing")
    (data . "editing data (non-text) files")
    (docs . "Emacs documentation facilities")
    (emulations . "emulations of other editors")
    (extensions . "Emacs Lisp language extensions")
    (faces . "fonts and colors for text")
    (files . "file editing and manipulation")
    (frames . "Emacs frames and window systems")
    (games . "games, jokes and amusements")
    (hardware . "interfacing with system hardware")
    (help . "Emacs help systems")
    (hypermedia . "links between text or other media types")
    (i18n . "internationalization and character-set support")
    (internal . "code for Emacs internals, build process, defaults")
    (languages . "specialized modes for editing programming languages")
    (lisp . "Lisp support, including Emacs Lisp")
    (local . "code local to your site")
    (maint . "Emacs development tools and aids")
    (mail . "email reading and posting")
    (matching . "searching, matching, and sorting")
    (mouse . "mouse support")
    (multimedia . "images and sound")
    (news . "USENET news reading and posting")
    (outlines . "hierarchical outlining and note taking")
    (processes . "processes, subshells, and compilation")
    (terminals . "text terminals (ttys)")
    (tex . "the TeX document formatter")
    (tools . "programming tools")
    (unix . "UNIX feature interfaces and emulators")
    (vc . "version control")
    (wp . "word processing"))
   #+end_example
4. [ ] Use #' instead of ' for function symbols
5. [X] Use ‘-’ as a separator, not ‘/’.
6. [ ] Consider reading:
   https://github.com/bbatsov/emacs-lisp-style-guide#the-emacs-lisp-style-guide
7. [ ] Use cl-loop, cl-first, cl-second, cl-third instead of loop, first, second,
   third; ie just C-c C-c the following.

   #+begin_src emacs-lisp
(defun my/re-replace-all-occurances-in-current-buffer (old new)
"Replace regular expression OLD with NEW, which may contain
  \\& in NEWTEXT means substitute original matched text.
  \\N means substitute what matched the Nth \(...\).
       If Nth parens didn't match, substitute nothing.
       Indexing begins at 1!
  \\\\ means insert one backslash.
"
  (save-excursion
    (goto-char 0)
    (while (ignore-errors (re-search-forward old))
      (replace-match new))))

(-let [cl-words '(loop first second third)]
     (find-file proj.el)
     (loop for oops in (mapcar #'symbol-name cl-words)
           do (my/re-replace-all-occurances-in-current-buffer
               (format "(\\(%s\\) " (regexp-quote oops))
               "(cl-\\1 ")))
   #+end_src

   #+RESULTS:

9. [ ] =M-x checkdoc= on the lisp file to ensure it passes expected style issues.
   - Symbols =nil, t= should not appear in single quotes.

     C-c C-c; if there is an error, you'll be redirected to it.
      #+begin_src emacs-lisp
   (find-file proj.el)
   (checkdoc)
   #+end_src

   #+RESULTS:
   : t

10. [ ] Ensure that package-linter raises no issues; i.e., the following has no result.
     #+BEGIN_SRC emacs-lisp
 (use-package package-lint)
  (find-file-other-window proj.el)
  (package-lint-buffer (car (last (s-split "/" proj.el))))
 #+END_SRC

 #+RESULTS:

11. [X] Create a recipe file by invoking: M-x package-build-create-recipe
    - Place it in: melpa/recipes/
    - The name of the file should be the name of the package, no extension.

       #+BEGIN_SRC emacs-lisp :tangle ~/melpa/recipes/org-special-block-extras
    (ob-latex-as-png :fetcher github :repo "alhassy/ob-latex-as-png")
    #+END_SRC
12. [ ] Commit and push everything in your project's repo!
13. [ ] Ensure the recipe builds successfully:
    #+BEGIN_SRC emacs-lisp
(shell-command-to-string (format "cd ~/melpa; rm ~/melpa/packages/%s-*; make recipes/%s" file file))
    #+END_SRC

    #+RESULTS:
    #+begin_example
     • Building package ob-latex-as-png ...
    Package: ob-latex-as-png
    Fetcher: github
    Source:  https://github.com/alhassy/ob-latex-as-png.git

    Updating /Users/musa/melpa/working/ob-latex-as-png/
    Built ob-latex-as-png in 1.446s, finished at Sun Jun 28 14:15:14 2020
     ✓ Success:
    16 -rw-r--r--  1 musa  staff   6.1K 28 Jun 14:15 packages/ob-latex-as-png-20200628.1811.el
     8 -rw-r--r--  1 musa  staff   418B 28 Jun 14:15 packages/ob-latex-as-png-20200628.1811.entry
     8 -rw-r--r--  1 musa  staff   1.0K 28 Jun 14:15 packages/ob-latex-as-png-badge.svg
     8 -rw-r--r--  1 musa  staff   786B 28 Jun 14:15 packages/ob-latex-as-png-readme.txt

    #+end_example

14. [ ] Ensure the package installs properly from within Emacs:

      #+BEGIN_SRC emacs-lisp
(thread-last (f-files "~/melpa/packages/")
  (--filter (s-contains? file it))
  (--filter (s-contains? ".el" it))
  car
  package-install-file)
#+END_SRC
     #+RESULTS:
     : #s(package-desc ob-latex-as-png (20200628 1811) "Org-babel functions for latex-as-png evaluation" ((emacs (26 1)) (org (9 1))) single nil nil ((:authors ("Musa Al-hassy" . "alhassy@gmail.com")) (:maintainer "Musa Al-hassy" . "alhassy@gmail.com") (:keywords "literate programming" "reproducible research" "org" "convenience") (:url . "https://github.com/alhassy/ob-latex-as-png")) nil)

15. [X] Produce a dedicated pull request branch

    #+begin_src emacs-lisp
    (magit-status "~/melpa")
    #+end_src

    + Now =b c= to checkout a new branch.
    + Push this branch on your melpa fork.
    + Go to the https://github.com/melpa/ repo and
      there'll be a big green PR button ^_^
* COMMENT Making ~README.org~
  :PROPERTIES:
  :CUSTOM_ID: COMMENT-Making-README-org
  :END:

  Evaluate the following source block with ~C-c C-c~ to produce a ~README~ file.

#+NAME: make-readme
#+BEGIN_SRC emacs-lisp
(org-md-export-to-markdown)
; (async-shell-command "grip")
; Running on http://localhost:6419/
#+END_SRC

#+RESULTS: make-readme
: README.md

*Then* use =grip= to see that this looks reasonable.
